{
  "main": {
    "name": "Tommy Tayler",
    "occupation": "Graduate Software Engineer",
    "description": "I am passionate about using programming to solve problems, to use the skills I have and the skills I learn to help people",
    "image": "profile-pic.png",
    "bio": "My name is Tommy, I have recently graduated from Auckland University of Technology with a Bachelor of Software Engineering (Honours). Currently I'm learning React.js while looking for a graduate position",
    "contactmessage": "Get in touch with me to receive further details or to let me know of any job openings",
    "email": "Thomasisaactayler@gmail.com",
    "phone": "+64 27 686 3626",
    "address": {
      "street": "",
      "city": "Auckland",
      "zip": "1026"
    },
    "website": "http://www.tommytayler.com",
    "resumedownload": "https://drive.google.com/uc?export=download&id=1hAuXeaegsle9Aeb4sFDxQI-MxE_S2FHx",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/thomas.tayler.7/",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/thomas-tayler/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/thomastayler",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "The skills below represent how much exposure I have had to each programing language",
    "education": [
      {
        "school": "Auckland University of Technology (AUT)",
        "degree": "Bachelor of Engineering in Software",
        "graduated": "November 2020",
        "description": "Studying at AUT was an amazing experience, I have gained an understanding of engineering fundamentals, problem solving, design, research, risk management and professional responsibility. I feel privileged to have studied there. My favorite thing about AUT is how they teach practically. For example, my first programming paper I was thrown into coding and I loved it! Further into my years at uni I picked up a minor in Computational Intelligence, this was a good addition and taught me an overview of Ai and Machine Learning."
      }
    ],
    "work": [
      {
        "company": "Live for Tomorrow",
        "title": "Software Engineering Intern",
        "years": "Feb 2020 - Mar 2020, Oct 2020 - Present",
        "description": "Prototyping a crowd-sourced Helpline Finder website. Giving users, wherever they are in the world, access to the right helpline support for them as quickly as possible. Main objectives include speed, ease of use, and providing appropriate information are high priorities.",
        "tech": "Tech: React.js, Typescript, CSS, Vercel, Next.js, GitHub, Storybook, Adobe XD, InVision"
      },
      {
        "company": "Tandem Ministries NZ",
        "title": "Digital Strategies Intern",
        "years": "Mar 2020 - Nov 2020",
        "description": "Create and implement digital tools to further the mission of Tandem Ministries by creating and editing content for Tandem digital assets, Web and graphic design for Tandem digital assets.",
        "tech": "Tech: HTML, CSS, JavaScript, Adobe Experience Manager"
      },
      {
        "company": "TnT Software",
        "title": "Junior Software Developer",
        "years": "Sep 2017 - Dec 2019",
        "description": "Develop, create, and modify an inventory management and recording software for a plant nursery. Web development of company website.",
        "tech": "Tech: Ruby on rails, Heroku, Git, GitHub, Rollbar, Postgres, Postico"
      }
    ],
    "skills": [
      {
        "name": "Java",
        "level": "80%"
      },
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Ruby on rails",
        "level": "60%"
      },
      {
        "name": "HTML",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "50%"
      },
      {
        "name": "ReactJs",
        "level": "30%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Production planning and recording tool",
        "category": "Inventory management system built with Ruby on Rails",
        "image": "nursery.jpg",
        "url": "https://nurseryapp.com/"
      },
      {
        "title": "Help line finding website",
        "category": "Web app built with Typescript and Next.js",
        "image": "findahelpline.jpg",
        "url": "https://findahelpline.com/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Tommy was the sole developer in charge of this project. The client was impressed with Tommy’s development and system deployment. This project remains in production today which is a testament to Tommy’s produced work.",
        "user": "Tataihono Nikora"
      },
      {
        "text": "Tommy has been a pleasure to work with during this time. He is friendly, and a good listener, with a good work ethic exhibited both in our office environment. He communicates well, and I have been particularly impressed at his patience and careful explanation both during the training of our staff",
        "user": "Karl Udy"
      }
    ]
  }
}